python/throught_aware_router_demo/2025-03-28_21-03-22/round_robin/experiment_1/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=1024, sharegpt_output_len=100, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=64, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 1024/1024 [05:01<00:00,  3.39it/s]

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     1023      
Long requests:                           136       
Short requests:                          887       
Benchmark duration (s):                  301.98    
Total input tokens:                      540979    
Total generated tokens:                  520300    
Total generated tokens (retokenized):    520156    
Request throughput (req/s):              3.39      
Input token throughput (tok/s):          1791.43   
Output token throughput (tok/s):         1722.95   
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17351.61  
Median E2E Latency (ms):                 3666.02   
P95 E2E Latency (ms):                    70115.30  
P99 E2E Latency (ms):                    75409.63  
Long requests Mean E2E Latency (ms):     67624.29717422793
Short requests Mean E2E Latency (ms):    9643.5142414115
Long requests Median E2E Latency (ms):   68681.87879899994
Short requests Median E2E Latency (ms):  3593.20131100003
Long requests P95 E2E Latency (ms):      75514.27924775003
Short requests P95 E2E Latency (ms):     68157.97455659989
Long requests P99 E2E Latency (ms):      76181.76144335013
Short requests P99 E2E Latency (ms):     74961.80484074002
---------------Time to First Token----------------
Mean TTFT (ms):                          361.63    
Median TTFT (ms):                        228.99    
P95 TTFT (ms):                           1037.70   
P99 TTFT (ms):                           2731.01   
Long Requests Mean TTFT (ms):            531.62    
Short Requests Mean TTFT (ms):           335.57    
Long Requests Median TTFT (ms):          433.40    
Short Requests Median TTFT (ms):         214.01    
Long Requests P95 TTFT (ms):             827.81    
Short Requests P95 TTFT (ms):            1037.65   
Long Requests P99 TTFT (ms):             2779.04   
Short Requests P99 TTFT (ms):            2658.87   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.59     
Median TPOT (ms):                        33.63     
P99 TPOT (ms):                           42.02     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.61     
Median ITL (ms):                         43.32     
P99 ITL (ms):                            144.51    
==================================================